piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
/**
 *******************************************************************************
 * @file    MDR32VF0xI_flash.c
 * @author  Milandr Application Team
 * @version V0.2.0
 * @date    14/04/2025
 * @brief   This file contains all the FLASH firmware functions.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "MDR32VF0xI_flash.h"
#include "MDR32VF0xI_utils.h"
#include "system_MDR32VF0xI_it.h"

/** @addtogroup MDR32VF0xI_StdPeriph_Driver MDR32VF0xI Standard Peripheral Driver
 * @{
 */

/** @addtogroup FLASH FLASH
 * @{
 */

/** @defgroup FLASH_Private_Types FLASH Private Types
 * @{
 */

#if defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief FLASH program size. Only used for MDR1206AFI (ID = 215).
 */
typedef enum {
    FLASH_PROGRAM_SIZE_1BYTE = (uint32_t)(0x01), /*!< Select 1 byte to programming. */
    FLASH_PROGRAM_SIZE_2BYTE = (uint32_t)(0x02), /*!< Select 2 bytes to programming. */
    FLASH_PROGRAM_SIZE_4BYTE = (uint32_t)(0x04)  /*!< Select 4 bytes to programming. */
} FLASH_ProgramSize_TypeDef;

#define IS_FLASH_PROGRAM_SIZE(SIZE) (((SIZE) == FLASH_PROGRAM_SIZE_1BYTE) || \
                                     ((SIZE) == FLASH_PROGRAM_SIZE_2BYTE) || \
                                     ((SIZE) == FLASH_PROGRAM_SIZE_4BYTE))
#endif

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206)
/**
 * @brief FLASH memory banks for mass erase.
 */
typedef enum {
    FLASH_ERASE_BANK_MAIN = ((uint32_t)0x00), /*!< Select the FLASH main bank to erase. */
    FLASH_ERASE_BANK_ALL  = ((uint32_t)0x01)  /*!< Select the FLASH main and information banks to erase. */
} FLASH_EraseMemoryBank_TypeDef;

#define IS_FLASH_ERASE_BANK(BANK) (((BANK) == FLASH_ERASE_BANK_MAIN) || \
                                   ((BANK) == FLASH_ERASE_BANK_ALL))
#endif

/** @} */ /* End of the group FLASH_Private_Types */

/** @defgroup FLASH_Private_Defines FLASH Private Defines
 * @{
 */

/**
 * @brief FLASH address.
 */
#define FLASH_ADDR_BYTE_MASK     ((uint32_t)0x3)
#define FLASH_ADDR_HALFWORD_MASK ((uint32_t)0x2)

#if defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define FLASH_ADDR_SECTOR_POS                   2
#define FLASH_ADDR_SECTOR_MASK                  ((uint32_t)0x1 << FLASH_ADDR_SECTOR_POS)
#define FLASH_GET_SECTOR_NUMBER(ADDR)           (((ADDR) & FLASH_ADDR_SECTOR_MASK) >> FLASH_ADDR_SECTOR_POS)

#define IS_FLASH_PROGRAM_START_BYTE(START_BYTE) (((START_BYTE) & ~FLASH_ADDR_BYTE_MASK) == 0)
#define IS_FLASH_PROGRAM_END_BYTE(END_BYTE)     ((END_BYTE) <= 4)
#endif

/**
 * @brief FLASH page address.
 */
#if defined(USE_MDR32F02)
#define FLASH_GET_MAIN_PAGE_ADDR(PAGE) ((((PAGE) << FLASH_ADR_MAIN_XADR_PAGE_Pos) & FLASH_ADR_MAIN_XADR_PAGE_Msk) | FLASH_BASE)
#define FLASH_GET_INFO_PAGE_ADDR(PAGE) ((((PAGE) << FLASH_ADR_INFO_XADR_PAGE_Pos) & FLASH_ADR_INFO_XADR_PAGE_Msk) | FLASH_BASE)
#elif defined(USE_MDR1206FI)
#define FLASH_GET_MAIN_PAGE_ADDR(PAGE) ((((PAGE) << FLASH_ADR_MAIN_XADR_PAGE_Pos) & (FLASH_ADR_MAIN_XADR_PAGE_Msk | FLASH_ADR_MAIN_BLOCK_Msk)) | FLASH_BASE)
#define FLASH_GET_INFO_PAGE_ADDR(PAGE) ((((PAGE) << FLASH_ADR_INFO_XADR_PAGE_Pos) & (FLASH_ADR_INFO_XADR_PAGE_Msk | FLASH_ADR_INFO_BLOCK_Msk)) | FLASH_BOOT_BASE)
#elif defined(USE_MDR1206AFI)
#define FLASH_GET_MAIN_PAGE_ADDR(PAGE) (((((PAGE) << FLASH_ADR_MAIN_PAGE_Pos) & FLASH_ADR_MAIN_PAGE_Msk) << 1) | FLASH_BASE)
#define FLASH_GET_INFO_PAGE_ADDR(PAGE) (((((PAGE) << FLASH_ADR_INFO_PAGE_Pos) & FLASH_ADR_INFO_PAGE_Msk) << 1) | FLASH_BOOT_BASE)
#elif defined(USE_MDR1206)
#define FLASH_GET_MAIN_PAGE_ADDR_ID217(PAGE) ((((PAGE) << FLASH_ADR_MAIN_XADR_PAGE_Pos) & (FLASH_ADR_MAIN_XADR_PAGE_Msk | FLASH_ADR_MAIN_BLOCK_Msk)) | FLASH_BASE)
#define FLASH_GET_INFO_PAGE_ADDR_ID217(PAGE) ((((PAGE) << FLASH_ADR_INFO_XADR_PAGE_Pos) & (FLASH_ADR_INFO_XADR_PAGE_Msk | FLASH_ADR_INFO_BLOCK_Msk)) | FLASH_BOOT_MDR1206FI_BASE)
#define FLASH_GET_MAIN_PAGE_ADDR_ID215(PAGE) (((((PAGE) << FLASH_ADR_MAIN_PAGE_Pos) & FLASH_ADR_MAIN_PAGE_Msk) << 1) | FLASH_BASE)
#define FLASH_GET_INFO_PAGE_ADDR_ID215(PAGE) (((((PAGE) << FLASH_ADR_INFO_PAGE_Pos) & FLASH_ADR_INFO_PAGE_Msk) << 1) | FLASH_BOOT_MDR1206AFI_BASE)
#endif

/**
 * @brief FLASH page number.
 */
#if defined(USE_MDR32F02)
#define IS_FLASH_MAIN_PAGE_NUMBER(PAGE) (((PAGE) & ~(uint32_t)(FLASH_ADR_MAIN_XADR_PAGE_Msk >> FLASH_ADR_MAIN_XADR_PAGE_Pos)) == 0)
#define IS_FLASH_INFO_PAGE_NUMBER(PAGE) (((PAGE) & ~(uint32_t)(FLASH_ADR_INFO_XADR_PAGE_Msk >> FLASH_ADR_INFO_XADR_PAGE_Pos)) == 0)
#elif defined(USE_MDR1206FI)
#define FLASH_GET_INFO_PAGE_NUMBER(ADDR) (((ADDR) & (FLASH_ADR_INFO_XADR_PAGE_Msk | FLASH_ADR_INFO_BLOCK_Msk)) >> FLASH_ADR_INFO_XADR_PAGE_Pos)
#define IS_FLASH_MAIN_PAGE_NUMBER(PAGE)  (((PAGE) & ~(uint32_t)((FLASH_ADR_MAIN_XADR_PAGE_Msk | FLASH_ADR_MAIN_BLOCK_Msk) >> FLASH_ADR_MAIN_XADR_PAGE_Pos)) == 0)
#define IS_FLASH_INFO_PAGE_NUMBER(PAGE)  (((PAGE) & ~(uint32_t)((FLASH_ADR_INFO_XADR_PAGE_Msk | FLASH_ADR_INFO_BLOCK_Msk) >> FLASH_ADR_INFO_XADR_PAGE_Pos)) == 0)
#elif defined(USE_MDR1206AFI)
#define FLASH_GET_INFO_PAGE_NUMBER(ADDR) ((((ADDR) >> 1) & FLASH_ADR_INFO_PAGE_Msk) >> FLASH_ADR_INFO_PAGE_Pos)
#define IS_FLASH_MAIN_PAGE_NUMBER(PAGE)  (((PAGE) & ~(uint32_t)(FLASH_ADR_MAIN_PAGE_Msk >> FLASH_ADR_MAIN_PAGE_Pos)) == 0)
#define IS_FLASH_INFO_PAGE_NUMBER(PAGE)  ((((PAGE) & ~(uint32_t)(FLASH_ADR_INFO_PAGE_Msk >> FLASH_ADR_INFO_PAGE_Pos)) == 0) && ((PAGE) != 15))
#elif defined(USE_MDR1206)
#define FLASH_GET_INFO_PAGE_NUMBER_ID217(ADDR) (((ADDR) & (FLASH_ADR_INFO_XADR_PAGE_Msk | FLASH_ADR_INFO_BLOCK_Msk)) >> FLASH_ADR_INFO_XADR_PAGE_Pos)
#define FLASH_GET_INFO_PAGE_NUMBER_ID215(ADDR) ((((ADDR) >> 1) & FLASH_ADR_INFO_PAGE_Msk) >> FLASH_ADR_INFO_PAGE_Pos)
#define IS_FLASH_MAIN_PAGE_NUMBER_ID217(PAGE)  (((PAGE) & ~(uint32_t)((FLASH_ADR_MAIN_XADR_PAGE_Msk | FLASH_ADR_MAIN_BLOCK_Msk) >> FLASH_ADR_MAIN_XADR_PAGE_Pos)) == 0)
#define IS_FLASH_INFO_PAGE_NUMBER_ID217(PAGE)  (((PAGE) & ~(uint32_t)((FLASH_ADR_INFO_XADR_PAGE_Msk | FLASH_ADR_INFO_BLOCK_Msk) >> FLASH_ADR_INFO_XADR_PAGE_Pos)) == 0)
#define IS_FLASH_MAIN_PAGE_NUMBER_ID215(PAGE)  (((PAGE) & ~(uint32_t)(FLASH_ADR_MAIN_PAGE_Msk >> FLASH_ADR_MAIN_PAGE_Pos)) == 0)
#define IS_FLASH_INFO_PAGE_NUMBER_ID215(PAGE)  ((((PAGE) & ~(uint32_t)(FLASH_ADR_INFO_PAGE_Msk >> FLASH_ADR_INFO_PAGE_Pos)) == 0) && ((PAGE) != 15))
#endif

/**
 * @brief FLASH factory data.
 */
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#if defined(USE_FACTORY_DATA_PROTECTION)
#define FLASH_FACTORY_DATA_PAGE_NUMBER_ID217 (3)
#define FLASH_FACTORY_DATA_PAGE_NUMBER_ID215 (14)
#define FLASH_ADDR_INFO_WORD_MASK_ID217      (FLASH_ADR_INFO_BLOCK_Msk | FLASH_ADR_INFO_XADR_Msk | FLASH_ADR_YADR_Msk)
#define FLASH_ADDR_INFO_WORD_MASK_ID215      (((FLASH_ADR_INFO_PAGE_Msk | FLASH_ADR_ROW_Msk | FLASH_ADR_WORD_Msk) << 1) | FLASH_ADDR_SECTOR_MASK)
#if defined(USE_MDR1206FI)
#define FLASH_FACTORY_DATA_START_ADDR_ID217 (MDR_FLASH_SPECIAL_FIELDS_BASE & FLASH_ADDR_INFO_WORD_MASK_ID217)
#define FLASH_FACTORY_DATA_END_ADDR_ID217   ((MDR_FLASH_SPECIAL_FIELDS_BASE & FLASH_ADDR_INFO_WORD_MASK_ID217) + 0x1B)
#elif defined(USE_MDR1206AFI)
#define FLASH_FACTORY_DATA_START_ADDR_ID215 (MDR_FLASH_SPECIAL_FIELDS_BASE & FLASH_ADDR_INFO_WORD_MASK_ID215)
#define FLASH_FACTORY_DATA_END_ADDR_ID215   ((MDR_FLASH_SPECIAL_FIELDS_BASE & FLASH_ADDR_INFO_WORD_MASK_ID215) + 0x1B)
#elif defined(USE_MDR1206)
#define FLASH_FACTORY_DATA_START_ADDR_ID217 (MDR_FLASH_SPECIAL_FIELDS_MDR1206FI_BASE & FLASH_ADDR_INFO_WORD_MASK_ID217)
#define FLASH_FACTORY_DATA_END_ADDR_ID217   ((MDR_FLASH_SPECIAL_FIELDS_MDR1206FI_BASE & FLASH_ADDR_INFO_WORD_MASK_ID217) + 0x1B)
#define FLASH_FACTORY_DATA_START_ADDR_ID215 (MDR_FLASH_SPECIAL_FIELDS_MDR1206AFI_BASE & FLASH_ADDR_INFO_WORD_MASK_ID215)
#define FLASH_FACTORY_DATA_END_ADDR_ID215   ((MDR_FLASH_SPECIAL_FIELDS_MDR1206AFI_BASE & FLASH_ADDR_INFO_WORD_MASK_ID215) + 0x1B)
#endif
#endif
#endif

/** @} */ /* End of the group FLASH_Private_Defines */

