piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
/** @addtogroup FLASH_Private_Functions FLASH Private Functions
 * @{
 */

/** @addtogroup FLASH_Private_Functions_Not_Allowed_to_Be_Located_in_FLASH Functions Not Allowed to Be Located in the FLASH
 * @{
 */

#if defined(USE_MDR1206)
__RAM_TEXT static uint32_t FLASH_ReadWord_ID217(uint32_t Address, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ReadWordBurst_ID217(uint32_t Address, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ReadWordArrayBurst_ID217(const uint32_t* PtrAddressArray, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ErasePage_ID217(uint32_t Address, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_EraseAllPages_ID217(FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_MassErase_ID217(FLASH_EraseMemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ProgramWord_ID217(uint32_t Address, uint32_t Data, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ProgramHalfWord_ID217(uint32_t Address, uint16_t Data, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ProgramByte_ID217(uint32_t Address, uint8_t Data, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ProgramWordBurst_ID217(uint32_t Address, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ProgramWordArrayBurst_ID217(const uint32_t* PtrAddressArray, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank);

__RAM_TEXT static uint32_t FLASH_ReadWord_ID215(uint32_t Address, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ReadWordBurst_ID215(uint32_t Address, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ReadWordArrayBurst_ID215(const uint32_t* PtrAddressArray, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ErasePage_ID215(uint32_t Address, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_EraseAllPages_ID215(FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_MassErase_ID215(void);
__RAM_TEXT static void     FLASH_ProgramWord_ID215(uint32_t Address, uint32_t Data, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ProgramHalfWord_ID215(uint32_t Address, uint16_t Data, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ProgramByte_ID215(uint32_t Address, uint8_t Data, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ProgramWordBurst_ID215(uint32_t Address, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static void     FLASH_ProgramWordArrayBurst_ID215(const uint32_t* PtrAddressArray, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank);

__RAM_TEXT __STATIC_FORCEINLINE void FLASH_ProgramCycle_ID217(uint32_t Command, uint32_t DelayProg);
__RAM_TEXT __STATIC_FORCEINLINE void FLASH_ProgramCycle_ID215(uint32_t StartByte, FLASH_ProgramSize_TypeDef Size, uint32_t Command, uint32_t DelayProg, uint32_t DelayAdsAdh);
#endif

/** @addtogroup FLASH_Private_Register_Access_Functions_Not_Allowed_to_Be_Located_in_FLASH FLASH Register Access Functions
 * @{
 */

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#if defined(USE_FACTORY_DATA_PROTECTION)
__RAM_TEXT static uint32_t FLASH_GetInfoPageNumber(uint32_t PageAddress);
#endif
#endif

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
__RAM_TEXT static void               FLASH_MassErase(FLASH_EraseMemoryBank_TypeDef Bank);
__RAM_TEXT __STATIC_FORCEINLINE void FLASH_ProgramCycle(uint32_t Command, uint32_t DelayProg);
#elif defined(USE_MDR1206AFI)
__RAM_TEXT static void               FLASH_MassErase(void);
__RAM_TEXT __STATIC_FORCEINLINE void FLASH_ProgramCycle(uint32_t StartByte, FLASH_ProgramSize_TypeDef Size, uint32_t Command, uint32_t DelayProg, uint32_t DelayAdsAdh);
#endif

#if defined(USE_MDR1206AFI) || defined(USE_MDR1206)
__RAM_TEXT static void     FLASH_ProgramBytes(uint32_t Address, uint32_t Data, FLASH_ProgramSize_TypeDef Size, FLASH_MemoryBank_TypeDef Bank);
__RAM_TEXT static uint32_t FLASH_ConvertAddress(uint32_t Address, FLASH_MemoryBank_TypeDef Bank);
#endif

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#if defined(USE_FACTORY_DATA_PROTECTION)
/**
 * @brief  Get the FLASH page number for the information bank.
 * @param  PageAddress: The FLASH page address.
 * @return The FLASH page number for the selected address.
 */
static uint32_t FLASH_GetInfoPageNumber(uint32_t PageAddress)
{
    uint32_t PageNumber;

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI)
    PageNumber = FLASH_GET_INFO_PAGE_NUMBER(PageAddress);
#elif defined(USE_MDR1206)
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        PageNumber = FLASH_GET_INFO_PAGE_NUMBER_ID217(PageAddress);
    } else {
        PageNumber = FLASH_GET_INFO_PAGE_NUMBER_ID215(PageAddress);
    }
#endif

    return PageNumber;
}
#endif
#endif

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206)
/**
 * @brief  Erase the main bank or the main and the information banks.
 * @note   This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @param  Bank: @ref FLASH_EraseMemoryBank_TypeDef - select a FLASH bank to erase.
 *         This parameter can be one of the following values:
 *             @arg FLASH_ERASE_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_ERASE_BANK_ALL:  The FLASH main and information banks.
 * @return None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
static void FLASH_MassErase(FLASH_EraseMemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_MassErase_ID217(FLASH_EraseMemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t DelayConst;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206)
    uint32_t Block;
#endif
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_ERASE_BANK(Bank));

    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = (MDR_FLASH->CMD & FLASH_CMD_DELAY_Msk) | FLASH_CMD_CON | FLASH_CMD_TMR;
    Command |= (Bank == FLASH_ERASE_BANK_ALL) ? FLASH_CMD_IFREN : 0;
    MDR_FLASH->CMD = Command;

#if defined(USE_MDR1206FI) || defined(USE_MDR1206)
    for (Block = 0; Block < 2; Block++) {
        MDR_FLASH->ADR = (Block << FLASH_ADR_MAIN_BLOCK_Pos) | (Block << FLASH_ADR_INFO_BLOCK_Pos);
#endif
        Command |= FLASH_CMD_XE | FLASH_CMD_MAS1 | FLASH_CMD_ERASE;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVS_US, DelayConst));

        Command |= FLASH_CMD_NVSTR;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TME_US, DelayConst));

        Command &= ~FLASH_CMD_ERASE;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVH1_US, DelayConst));

        Command &= ~(FLASH_CMD_XE | FLASH_CMD_MAS1 | FLASH_CMD_NVSTR);
        MDR_FLASH->CMD = Command;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206)
    }
#endif
    MDR_FLASH->CMD = (Command & FLASH_CMD_DELAY_Msk) | FLASH_CMD_TMR;
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief  Cycle for programming an 32-bit value.
 *         The initial programming procedure must first be completed.
 * @note   This function can be used only for MDR32F02 or MDR1206FI (ID = 217).
 * @param  Command: The command value, to which is added the set/clear of PROG2 bit.
 * @param  DelayProg: FLASH_TPROG_US delay time in loops.
 * @return None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_ProgramCycle(uint32_t Command, uint32_t DelayProg)
#elif defined(USE_MDR1206)
/** @cond */
void FLASH_ProgramCycle_ID217(uint32_t Command, uint32_t DelayProg)
/** @endcond */
#endif
{
    Command |= FLASH_CMD_YE;
    MDR_FLASH->CMD = Command;
    DELAY_CycleCounter_WaitTicksAsm(DelayProg);

