piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
    Command &= ~FLASH_CMD_YE;
    MDR_FLASH->CMD = Command;
}
#endif

#if defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief  Erase the main memory bank.
 * @note   This function can be used only for MDR1206AFI (ID = 215).
 * @param  None.
 * @return None.
 */
#if defined(USE_MDR1206AFI)
static void FLASH_MassErase(void)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_MassErase_ID215(void)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t DelayConst;
    uint32_t Sector;
    uint32_t MStatus;

    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);

    MStatus        = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command        = FLASH_CMD_CON | FLASH_CMD_TMEN;
    MDR_FLASH->CMD = Command;

    for (Sector = 0; Sector < 2; Sector++) {
        MDR_FLASH->ADR = Sector << FLASH_ADR_MAIN_SECTOR_Pos;
        Command |= FLASH_CMD_CE | FLASH_CMD_CHIP | FLASH_CMD_ERASE;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVS_CHIP_ERASE_US, DelayConst));

        Command |= FLASH_CMD_WE;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TERASE_CHIP_ERASE_US, DelayConst));

        Command &= ~FLASH_CMD_WE;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRCV_CHIP_ERASE_US, DelayConst));

        Command &= ~(FLASH_CMD_CE | FLASH_CMD_CHIP | FLASH_CMD_ERASE);
        MDR_FLASH->CMD = Command;
    }
    MDR_FLASH->CMD = FLASH_CMD_TMEN;

    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRW_CHIP_ERASE_US, DelayConst));
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief  Cycle for programming an 8-bit values within a 32-bit word.
 *         The initial programming procedure must first be completed.
 * @note   This function can be used only for MDR1206AFI (ID = 215).
 * @param  StartByte: Byte from which programming begins. Must be from 0 to 3.
 * @param  Size: @ref FLASH_ProgramSize_TypeDef - select a number of bytes for programming. Should be StartByte + Size <= 4.
 * @param  Command: The command value, to which is added the set/clear of PROG2 bit.
 * @param  DelayProg: FLASH_TPROG_PROGRAM_US delay time in loops.
 * @param  DelayAdsAdh: FLASH_TADS_PROGRAM_US/FLASH_TADH_PROGRAM_US delay time in loops.
 * @return None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_ProgramCycle(uint32_t StartByte, FLASH_ProgramSize_TypeDef Size, uint32_t Command, uint32_t DelayProg, uint32_t DelayAdsAdh)
#elif defined(USE_MDR1206)
/** @cond */
void FLASH_ProgramCycle_ID215(uint32_t StartByte, FLASH_ProgramSize_TypeDef Size, uint32_t Command, uint32_t DelayProg, uint32_t DelayAdsAdh)
/** @endcond */
#endif
{
    uint32_t Byte;

    /* Check the parameters. */
    assert_param(IS_FLASH_PROGRAM_START_BYTE(StartByte));
    assert_param(IS_FLASH_PROGRAM_SIZE(Size));
    assert_param(IS_FLASH_PROGRAM_END_BYTE(StartByte + (uint32_t)Size));

    for (Byte = StartByte; Byte < StartByte + (uint32_t)Size; Byte++) {
        MDR_FLASH->CTRL = 1 << Byte;
        DELAY_CycleCounter_WaitTicksAsm(DelayAdsAdh);

        Command |= FLASH_CMD_PROG2;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DelayProg);

        Command &= ~FLASH_CMD_PROG2;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DelayAdsAdh);
    }
}

/**
 * @brief   Program the specified number of 8-bit FLASH memory values.
 * @warning The same address (8-bit data) can't be programmed again before next erase.
 * @note    This function can be used only for MDR1206AFI (ID = 215).
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramBytes(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory address.
 * @param   Data: 32-bit data whose bytes will be program.
 * @param   Size: @ref FLASH_ProgramSize_TypeDef - select a number of bytes for programming.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *                This parameter can be one of the following values:
 *                    @arg FLASH_BANK_MAIN: The FLASH main bank;
 *                    @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
static void FLASH_ProgramBytes(uint32_t Address, uint32_t Data, FLASH_ProgramSize_TypeDef Size, FLASH_MemoryBank_TypeDef Bank)
{
    uint32_t Command;
    uint32_t DelayConst;
    uint32_t DelayProg;
    uint32_t DelayAdsAdh;
    uint32_t DelayPgs;
    uint32_t StartByte;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_PROGRAM_SIZE(Size));
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

#if defined(USE_FACTORY_DATA_PROTECTION)
    if (Bank == FLASH_BANK_INFO) {
        if (((Address & FLASH_ADDR_INFO_WORD_MASK_ID215) >= FLASH_FACTORY_DATA_START_ADDR_ID215) &&
            ((Address & FLASH_ADDR_INFO_WORD_MASK_ID215) <= FLASH_FACTORY_DATA_END_ADDR_ID215)) {
            return;
        }
    }
#endif

    if (Size == FLASH_PROGRAM_SIZE_4BYTE) {
        Address &= ~FLASH_ADDR_FOUR_BYTE_ALIGN_MASK;
    } else if (Size == FLASH_PROGRAM_SIZE_2BYTE) {
        Address &= ~FLASH_ADDR_TWO_BYTE_ALIGN_MASK;
    }

    StartByte   = Address & FLASH_ADDR_BYTE_MASK;
    DelayConst  = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);
    DelayProg   = DELAY_GET_TICKS_US(FLASH_TPROG_PROGRAM_US, DelayConst);
    DelayAdsAdh = DELAY_GET_TICKS_US(FLASH_TADS_PROGRAM_US, DelayConst);
    DelayPgs    = DELAY_GET_TICKS_US(FLASH_TPGS_PROGRAM_US, DelayConst);

    /* Correct DelayProg for SystemCoreClock <= 16 MHz. */
    DelayProg = (SystemCoreClock > 16000000) ? DelayProg : DelayProg - 7;

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = FLASH_CMD_CON | FLASH_CMD_TMEN;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_NVR : 0;
    MDR_FLASH->CMD = Command;

    MDR_FLASH->ADR = FLASH_ConvertAddress(Address, Bank);
    MDR_FLASH->DI  = Data;

    Command |= FLASH_CMD_CE | FLASH_CMD_PROG;
    MDR_FLASH->CMD = Command;
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVS_PROGRAM_US, DelayConst));

    Command |= FLASH_CMD_WE;
    MDR_FLASH->CMD = Command;
    DELAY_CycleCounter_WaitTicksAsm(DelayPgs);

