piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
#if defined(USE_MDR1206AFI)
    FLASH_ProgramCycle(StartByte, Size, Command, DelayProg, DelayAdsAdh);
#elif defined(USE_MDR1206)
    FLASH_ProgramCycle_ID215(StartByte, Size, Command, DelayProg, DelayAdsAdh);
#endif

    Command &= ~FLASH_CMD_WE;
    MDR_FLASH->CMD = Command;
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRCV_PROGRAM_US, DelayConst));

    Command &= ~(FLASH_CMD_CE | FLASH_CMD_PROG);
    MDR_FLASH->CMD = Command;
    MDR_FLASH->CMD = FLASH_CMD_TMEN;

    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRW_PROGRAM_US, DelayConst));
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief  Convert the FLASH memory word address to a special address required for register access.
 * @note   This function can be used only for MDR1206AFI (ID = 215).
 * @param  Address: A FLASH memory word address.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return Address required for register access.
 */
static uint32_t FLASH_ConvertAddress(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
{
    if (FLASH_GET_SECTOR_NUMBER(Address) == 0) {
        Address = (Address >> 1) & ((Bank == FLASH_BANK_INFO) ? ~FLASH_ADR_INFO_SECTOR_Msk : ~FLASH_ADR_MAIN_SECTOR_Msk);
    } else {
        Address = (Address >> 1) | ((Bank == FLASH_BANK_INFO) ? FLASH_ADR_INFO_SECTOR_Msk : FLASH_ADR_MAIN_SECTOR_Msk);
    }

    return Address;
}
#endif

/** @} */ /* End of the group FLASH_Private_Register_Access_Functions_Not_Allowed_to_Be_Located_in_FLASH */

/** @} */ /* End of the group FLASH_Private_Functions_Not_Allowed_to_Be_Located_in_FLASH */

/** @} */ /* End of the group FLASH_Private_Functions */

/** @addtogroup FLASH_Exported_Functions FLASH Exported Functions
 * @{
 */

/** @addtogroup FLASH_Exported_Functions_Allowed_to_Be_Located_in_FLASH Functions Allowed to Be Located in the FLASH
 * @{
 */

/** @addtogroup FLASH_Exported_Control_Functions_Allowed_to_Be_Located_in_FLASH FLASH Control Functions
 * @{
 */

/**
 * @brief  Lock/Unlock access to FLASH memory via registers (locked by default).
 * @param  LockState: @ref FlagStatus - a new lock state of the access to FLASH memory via registers.
 *         This parameter must be one of the @ref FlagStatus values:
 *             @arg RESET: Unlock the access;
 *             @arg SET: Lock the access.
 * @return None.
 */
void FLASH_SetRegistersLock(FlagStatus LockState)
{
    /* Check the parameters. */
    assert_param(IS_BIT_STATUS(LockState));

    if (LockState != RESET) {
        /* Lock access if SET. */
        MDR_FLASH->KEY = FLASH_KEY_KEY_LOCK;
    } else {
        /* Unlock access if RESET. */
        MDR_FLASH->KEY = FLASH_KEY_KEY_UNLOCK;
    }
}

/**
 * @brief  Get the current state of access to FLASH memory via registers (locked by default).
 * @param  None.
 * @return @ref FlagStatus - lock state:
 *             @arg RESET: Unlocked;
 *             @arg SET: Locked.
 */
FlagStatus FLASH_GetRegistersLock(void)
{
    if (MDR_FLASH->KEY == FLASH_KEY_KEY_UNLOCK) {
        /* Access to FLASH memory via registers is unlocked. */
        return RESET;
    } else {
        /* Access to FLASH memory via registers is locked. */
        return SET;
    }
}

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief  Get microcontroller ID for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @param  None.
 * @return Microcontroller ID value.
 */
uint8_t FLASH_GetChipID(void)
{
    uint32_t ChipID;

    ChipID = MDR_FLASH->CHIP_ID_CTRL;
    ChipID = (ChipID & FLASH_CHIP_ID_CTRL_CHIP_ID_Msk) >> FLASH_CHIP_ID_CTRL_CHIP_ID_Pos;

    return (uint8_t)ChipID;
}
#endif

/** @} */ /* End of the group FLASH_Exported_Control_Functions_Allowed_to_Be_Located_in_FLASH */

/** @addtogroup FLASH_Exported_Special_Fields_Control_Functions_Allowed_to_Be_Located_in_FLASH FLASH Special Fields Control Functions
 * @{
 */

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief   Program protection bits for selected FLASH memory regions.
 * @warning After programming the JTAG interface is blocked.
 * @param   ProtectionRegions: Protection regions.
 *          This parameter must be any combination of @ref FLASH_ProtectionRegions_TypeDef values.
 * @return  None.
 */
void FLASH_ProgramProtection(uint32_t ProtectionRegions)
{
    uint32_t Protection;
    uint32_t ProtectionAddr;

    /* Check the parameters. */
    assert_param(IS_FLASH_PROTECTION_REGIONS(ProtectionRegions));

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI)
    ProtectionAddr = (uint32_t)&MDR_FLASH_SPECIAL_FIELDS->PROTECTION;
#elif defined(USE_MDR1206)
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        ProtectionAddr = (uint32_t)&MDR_FLASH_SPECIAL_FIELDS_MDR1206FI->PROTECTION;
    } else {
        ProtectionAddr = (uint32_t)&MDR_FLASH_SPECIAL_FIELDS_MDR1206AFI->PROTECTION;
    }
#endif

    Protection = FLASH_SPECIAL_FIELDS_PROTECTION_KEY_UNLOCK | (~ProtectionRegions & FLASH_SPECIAL_FIELDS_PROTECTION_REGIONS_Msk);
    FLASH_ProgramWord(ProtectionAddr, Protection, FLASH_BANK_INFO);
}

/**
 * @brief  Read protection state of the FLASH memory regions.
 * @param  None.
 * @return A combined value of the individual protection states (@ref FLASH_ProtectionRegions_TypeDef).
 */
uint32_t FLASH_ReadProtection(void)
{
    uint32_t Protection;

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI)
    Protection = MDR_FLASH_SPECIAL_FIELDS->PROTECTION;
#elif defined(USE_MDR1206)
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        Protection = MDR_FLASH_SPECIAL_FIELDS_MDR1206FI->PROTECTION;
    } else {
        Protection = MDR_FLASH_SPECIAL_FIELDS_MDR1206AFI->PROTECTION;
    }
#endif

    if ((Protection & FLASH_SPECIAL_FIELDS_PROTECTION_KEY_Msk) == FLASH_SPECIAL_FIELDS_PROTECTION_KEY_UNLOCK) {
        Protection = ~Protection & FLASH_SPECIAL_FIELDS_PROTECTION_REGIONS_Msk;
    } else {
        Protection = 0;
    }

    return Protection;
}

/**
 * @brief  Program factory data (UNIQUE_ID, TRIMs) and checksum (TRIM_CS) into FLASH memory.
 * @note   If USE_FACTORY_DATA_PROTECTION is defined, then factory data programming is not performed.
 * @param  FactoryData: The pointer to the @ref FLASH_FactoryData_TypeDef structure
 *         that contains identification information and trim values.
 * @return None.
 */
void FLASH_ProgramFactoryData(const FLASH_FactoryData_TypeDef* FactoryData)
{
    uint32_t                         TrimWord;
    uint8_t                          TrimCS;
    uint32_t                         Index;
    const uint8_t*                   PtrFactoryData;
    MDR_FLASH_SpecialFields_TypeDef* FlashFactoryData;

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI)
    FlashFactoryData = MDR_FLASH_SPECIAL_FIELDS;
#elif defined(USE_MDR1206)
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FlashFactoryData = MDR_FLASH_SPECIAL_FIELDS_MDR1206FI;
    } else {
        FlashFactoryData = MDR_FLASH_SPECIAL_FIELDS_MDR1206AFI;
    }
#endif
    TrimWord = *((const uint32_t*)&FactoryData->TrimHSI);

    /* Checksum calculation. */
    PtrFactoryData = (const uint8_t*)FactoryData;
    for (TrimCS = 0, Index = 0; Index < 24; Index++) {
        TrimCS += PtrFactoryData[Index];
    }

    /* Program UNIQUE_ID, TRIMs and checksum (TRIM_CS) into FLASH memory. */
    for (Index = 0; Index < 5; Index++) {
        FLASH_ProgramWord((uint32_t)&FlashFactoryData->UNIQUE_ID[Index], FactoryData->UniqueID[Index], FLASH_BANK_INFO);
    }
    FLASH_ProgramWord((uint32_t)&FlashFactoryData->TRIM_HSI, TrimWord, FLASH_BANK_INFO);
    FLASH_ProgramByte((uint32_t)&FlashFactoryData->TRIM_CS, TrimCS, FLASH_BANK_INFO);
}

/**
 * @brief  Read factory data (UNIQUE_ID, TRIMs) from FLASH memory and verify the checksum (TRIM_CS).
 * @param  FactoryData: The pointer to the @ref FLASH_FactoryData_TypeDef structure
 *         where identification information and trim values should be stored.
 * @return @ref ErrorStatus - checksum verification result.
 */
ErrorStatus FLASH_ReadFactoryData(FLASH_FactoryData_TypeDef* FactoryData)
{
    uint8_t                          ReadTrimCS;
    uint8_t                          CalcTrimCS;
    uint32_t                         Index;
    uint8_t*                         PtrFactoryData;
    MDR_FLASH_SpecialFields_TypeDef* FlashFactoryData;

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI)
    FlashFactoryData = MDR_FLASH_SPECIAL_FIELDS;
#elif defined(USE_MDR1206)
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FlashFactoryData = MDR_FLASH_SPECIAL_FIELDS_MDR1206FI;
    } else {
        FlashFactoryData = MDR_FLASH_SPECIAL_FIELDS_MDR1206AFI;
    }
#endif

    /* Read UNIQUE_ID, TRIMs and checksum (TRIM_CS) from FLASH memory. */
    for (Index = 0; Index < 5; Index++) {
        FactoryData->UniqueID[Index] = FlashFactoryData->UNIQUE_ID[Index];
    }
    *((uint32_t*)&FactoryData->TrimHSI) = *((uint32_t*)&FlashFactoryData->TRIM_HSI);
    ReadTrimCS                          = FlashFactoryData->TRIM_CS;

    /* Checksum calculation. */
    PtrFactoryData = (uint8_t*)FactoryData;
    for (CalcTrimCS = 0, Index = 0; Index < 24; Index++) {
        CalcTrimCS += PtrFactoryData[Index];
    }

    /* Comparison of checksums. */
    if (ReadTrimCS != CalcTrimCS) {
        return ERROR;
    } else {
        return SUCCESS;
    }
}
#endif

