piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
/** @} */ /* End of the group FLASH_Exported_Special_Fields_Control_Functions_Allowed_to_Be_Located_in_FLASH */

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/** @addtogroup FLASH_Exported_JTAG_Locking_Functions_Allowed_to_Be_Located_in_FLASH FLASH JTAG Locking Functions
 * @{
 */

/**
 * @brief  Lock/Unlock write access to the CHIP_ID_CTRL register that performs JTAG blocking.
 *         The CHIP_ID_CTRL register are locked by default.
 * @param  LockState: @ref FlagStatus - a new lock state of the CHIP_ID_CTRL register.
 *         This parameter must be one of the @ref FlagStatus values:
 *             @arg RESET: Unlock the write access;
 *             @arg SET: Lock the write access.
 * @return None.
 */
void FLASH_JTAG_SetRegistersLock(FlagStatus LockState)
{
    /* Check the parameters. */
    assert_param(IS_BIT_STATUS(LockState));

    if (LockState != RESET) {
        /* Lock write access if SET. */
        MDR_FLASH->OTP_KEY = FLASH_OTP_KEY_OTP_KEY_LOCK;
    } else {
        /* Unlock write access if RESET. */
        MDR_FLASH->OTP_KEY = FLASH_OTP_KEY_OTP_KEY_UNLOCK;
    }
}

/**
 * @brief  Get the current CHIP_ID_CTRL register write access lock state.
 *         The CHIP_ID_CTRL register are locked by default.
 * @param  None.
 * @return @ref FlagStatus - write lock state:
 *             @arg RESET: Unlocked;
 *             @arg SET: Locked.
 */
FlagStatus FLASH_JTAG_GetRegistersLock(void)
{
    if (MDR_FLASH->OTP_KEY == FLASH_OTP_KEY_OTP_KEY_UNLOCK) {
        /* CHIP_ID_CTRL write access is unlocked. */
        return RESET;
    } else {
        /* CHIP_ID_CTRL write access is locked. */
        return SET;
    }
}

/**
 * @brief   Lock the JTAG interface permanently by programming the OTP memory.
 * @warning After programming the OTP memory, the JTAG interface will be locked forever.
 * @note    Available in microcontrollers since rev. 2.0.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_JTAG_SetLockForever(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   None.
 * @return  None.
 */
void FLASH_JTAG_SetLockForever(void)
{
    uint32_t Iteration;
    uint32_t OTPProg;
    uint32_t DelayConst;
    uint32_t MStatus;

    OTPProg    = FLASH_CHIP_ID_CTRL_OTP_PROG;
    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_MS(SystemCoreClock);

    MStatus                 = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    MDR_FLASH->CHIP_ID_CTRL = OTPProg;
    for (Iteration = 0; Iteration < 5; Iteration++) {
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_MS(1, DelayConst));
        OTPProg ^= FLASH_CHIP_ID_CTRL_OTP_PROG;
        MDR_FLASH->CHIP_ID_CTRL = OTPProg;
    }
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief  Get the JTAG interface lock status.
 * @note   Available in microcontrollers since rev. 2.0.
 * @param  None.
 * @return @ref FlagStatus - JTAG interface lock status:
 *             @arg RESET: Unlocked;
 *             @arg SET: Locked.
 */
FlagStatus FLASH_JTAG_GetLockStatus(void)
{
    FlagStatus Status;

    if (MDR_FLASH->CHIP_ID_CTRL & FLASH_CHIP_ID_CTRL_OTPTST2) {
        Status = SET;
    } else {
        Status = RESET;
    }

    return Status;
}

/** @} */ /* End of the group FLASH_Exported_JTAG_Locking_Functions_Allowed_to_Be_Located_in_FLASH */
#endif

/** @addtogroup FLASH_Exported_Register_Access_Functions_Allowed_to_Be_Located_in_FLASH FLASH Register Access Functions
 * @{
 */

/**
 * @brief  Get the FLASH page address (can be used for FLASH_ErasePage()).
 * @param  PageNumber: The FLASH page number.
 *         This parameter is a value:
 *         - MDR32F02: main bank - from 0 to 63, information bank - from 0 to 1;
 *         - MDR1206FI: main bank - from 0 to 127, information bank - from 0 to 3;
 *         - MDR1206AFI: main bank - from 0 to 511, information bank - from 0 to 14.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return The address of selected FLASH page.
 */
uint32_t FLASH_GetPageAddress(uint32_t PageNumber, FLASH_MemoryBank_TypeDef Bank)
{
    uint32_t PageAddress;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI)
    assert_param((Bank == FLASH_BANK_MAIN) ? IS_FLASH_MAIN_PAGE_NUMBER(PageNumber) : IS_FLASH_INFO_PAGE_NUMBER(PageNumber));
#elif defined(USE_MDR1206)
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        assert_param((Bank == FLASH_BANK_MAIN) ? IS_FLASH_MAIN_PAGE_NUMBER_ID217(PageNumber) : IS_FLASH_INFO_PAGE_NUMBER_ID217(PageNumber));
    } else {
        assert_param((Bank == FLASH_BANK_MAIN) ? IS_FLASH_MAIN_PAGE_NUMBER_ID215(PageNumber) : IS_FLASH_INFO_PAGE_NUMBER_ID215(PageNumber));
    }
#endif

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI)
    if (Bank == FLASH_BANK_MAIN) {
        PageAddress = FLASH_GET_MAIN_PAGE_ADDR(PageNumber);
    } else {
        PageAddress = FLASH_GET_INFO_PAGE_ADDR(PageNumber);
    }
#elif defined(USE_MDR1206)
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        if (Bank == FLASH_BANK_MAIN) {
            PageAddress = FLASH_GET_MAIN_PAGE_ADDR_ID217(PageNumber);
        } else {
            PageAddress = FLASH_GET_INFO_PAGE_ADDR_ID217(PageNumber);
        }
    } else {
        if (Bank == FLASH_BANK_MAIN) {
            PageAddress = FLASH_GET_MAIN_PAGE_ADDR_ID215(PageNumber);
        } else {
            PageAddress = FLASH_GET_INFO_PAGE_ADDR_ID215(PageNumber);
        }
    }
#endif

    return PageAddress;
}

/** @} */ /* End of the group FLASH_Exported_Register_Access_Functions_Allowed_to_Be_Located_in_FLASH */

/** @} */ /* End of the group FLASH_Exported_Functions_Allowed_to_Be_Located_in_FLASH */

/** @addtogroup FLASH_Exported_Functions_Not_Allowed_to_Be_Located_in_FLASH Functions Not Allowed to Be Located in the FLASH
 * @{
 */

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206)
/** @addtogroup FLASH_Exported_Control_Functions_Not_Allowed_to_Be_Located_in_FLASH FLASH Control Functions
 * @{
 */

/**
 * @brief  Set a FLASH latency value. Unlocking FLASH is not required before calling this function.
 * @param  Latency: @ref FLASH_Latency_TypeDef - specify a FLASH latency value in cycles.
 * @return None.
 */
void FLASH_SetLatency(FLASH_Latency_TypeDef Latency)
{
    /* Check the parameters. */
    assert_param(IS_FLASH_LATENCY(Latency));

    /* Set the new latency value. */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
    MDR_FLASH->CMD = (uint32_t)Latency | FLASH_CMD_TMR;
#elif defined(USE_MDR1206)
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        MDR_FLASH->CMD = (uint32_t)Latency | FLASH_CMD_TMR;
    }
#endif
#if defined(USE_MDR32F02)
    *((volatile uint32_t*)FLASH_BASE); /* Errata 0011 workaround. */
#endif
}

/**
 * @brief  Get a FLASH latency value. Unlocking FLASH is not required before calling this function.
 * @param  None.
 * @return @ref FLASH_Latency_TypeDef - a FLASH latency value in cycles.
 */
FLASH_Latency_TypeDef FLASH_GetLatency(void)
{
#if defined(USE_MDR1206)
    FLASH_Latency_TypeDef Latency = FLASH_LATENCY_CYCLE_1;

    if (GetChipID() == CHIP_ID_MDR1206FI) {
        Latency = (FLASH_Latency_TypeDef)(MDR_FLASH->CMD & FLASH_CMD_DELAY_Msk);
    }
#endif
    /* Return the current latency value. */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
    return (FLASH_Latency_TypeDef)(MDR_FLASH->CMD & FLASH_CMD_DELAY_Msk);
#elif defined(USE_MDR1206)
    return Latency;
#endif
}

