piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
/** @} */ /* End of the group FLASH_Exported_Control_Functions_Not_Allowed_to_Be_Located_in_FLASH */
#endif

/** @addtogroup FLASH_Exported_Register_Access_Functions_Not_Allowed_to_Be_Located_in_FLASH FLASH Register Access Functions
 * @{
 */

/**
 * @brief  Read a 16-bit FLASH memory value.
 * @note   Hardware supports only 32-bit word reading.
 * @param  Address: The FLASH memory half word address (two bytes aligned).
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return The selected FLASH memory halfword.
 */
uint16_t FLASH_ReadHalfWord(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
{
    uint32_t Data;
    uint32_t Shift;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));
    assert_param(IS_FLASH_ADDR_TWO_BYTE_ALIGNED(Address));

    Data = FLASH_ReadWord(Address & ~FLASH_ADDR_FOUR_BYTE_ALIGN_MASK, Bank);

    Shift = (Address & FLASH_ADDR_HALFWORD_MASK) * 8;
    Data >>= Shift;

    return (uint16_t)Data;
}

/**
 * @brief  Read an 8-bit FLASH memory value.
 * @note   Hardware supports only 32-bit word reading.
 * @param  Address: The FLASH memory byte address.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The main FLASH;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return The selected FLASH memory byte.
 */
uint8_t FLASH_ReadByte(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
{
    uint32_t Data;
    uint32_t Shift;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    Data = FLASH_ReadWord(Address & ~FLASH_ADDR_FOUR_BYTE_ALIGN_MASK, Bank);

    Shift = (Address & FLASH_ADDR_BYTE_MASK) * 8;
    Data >>= Shift;

    return (uint8_t)Data;
}

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206)
/**
 * @brief  Read a 32-bit FLASH memory value.
 * @note   This function can be used only for MDR32F02 or MDR1206FI (ID = 217).
 * @param  Address: A FLASH memory word address (four bytes aligned).
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return The selected FLASH memory word.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
uint32_t FLASH_ReadWord(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static uint32_t FLASH_ReadWord_ID217(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t Data;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));
    assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(Address));

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = (MDR_FLASH->CMD & FLASH_CMD_DELAY_Msk) | FLASH_CMD_CON | FLASH_CMD_TMR;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_IFREN : 0;
    MDR_FLASH->CMD = Command;
    MDR_FLASH->ADR = Address;
    MDR_FLASH->CMD = Command | FLASH_CMD_XE | FLASH_CMD_YE;
    MDR_FLASH->CMD = Command | FLASH_CMD_XE | FLASH_CMD_YE | FLASH_CMD_SE;
    MDR_FLASH->DO; /* Idle reading for delay. */
    MDR_FLASH->DO; /* Idle reading for delay. */
    Data           = MDR_FLASH->DO;
    Command        = (Command & FLASH_CMD_DELAY_Msk) | FLASH_CMD_TMR;
    MDR_FLASH->CMD = Command;

#if defined(USE_MDR32F02)
    Command = *((volatile uint32_t*)FLASH_BASE); /* Errata 0011 workaround. */
#endif
    CSR_Write(CSR_MSTATUS, MStatus);

    return Data;
}

/**
 * @brief  Read the array of the 32-bit FLASH memory values in the packet mode.
 * @note   This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @param  Address: A FLASH memory word address from which the array will be read (four bytes aligned).
 * @param  PtrDataArray: The pointer to the array where the words read from the FLASH MEMORY will be stored.
 * @param  ArraySize: The size of data array.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_ReadWordBurst(uint32_t Address, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ReadWordBurst_ID217(uint32_t Address, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t Index;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(Address));
    assert_param(ArraySize > 0);
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = (MDR_FLASH->CMD & FLASH_CMD_DELAY_Msk) | FLASH_CMD_CON | FLASH_CMD_TMR;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_IFREN : 0;
    MDR_FLASH->CMD = Command;

    for (Index = 0; Index < ArraySize; Index++) {
        MDR_FLASH->CMD = Command | FLASH_CMD_XE | FLASH_CMD_YE;
        MDR_FLASH->ADR = Address + Index * 4;
        MDR_FLASH->CMD = Command | FLASH_CMD_XE | FLASH_CMD_YE | FLASH_CMD_SE;
        MDR_FLASH->DO; /* Idle reading for delay. */
        MDR_FLASH->DO; /* Idle reading for delay. */
        PtrDataArray[Index] = MDR_FLASH->DO;
    }
    MDR_FLASH->CMD = (Command & FLASH_CMD_DELAY_Msk) | FLASH_CMD_TMR;

