piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
#if defined(USE_MDR32F02)
    Index = *((volatile uint32_t*)FLASH_BASE); /* Errata 0011 workaround. */
#endif
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief  Read the array of the 32-bit FLASH memory values at specified addresses from the array in the packet mode.
 * @note   This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @param  PtrAddressArray: The pointer to the array with FLASH memory words addresses to read (four bytes aligned).
 * @param  PtrDataArray: The pointer to the array where the words read from the FLASH MEMORY will be stored.
 * @param  ArraySize: The size of address and data arrays.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_ReadWordArrayBurst(const uint32_t* PtrAddressArray, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ReadWordArrayBurst_ID217(const uint32_t* PtrAddressArray, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t Index;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));
    assert_param(ArraySize > 0);
#if (USE_ASSERT_INFO != 0)
    for (Index = 0; Index < ArraySize; Index++) {
        assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(PtrAddressArray[Index]));
    }
#endif

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = (MDR_FLASH->CMD & FLASH_CMD_DELAY_Msk) | FLASH_CMD_CON | FLASH_CMD_TMR;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_IFREN : 0;
    MDR_FLASH->CMD = Command;

    for (Index = 0; Index < ArraySize; Index++) {
        MDR_FLASH->CMD = Command | FLASH_CMD_XE | FLASH_CMD_YE;
        MDR_FLASH->ADR = PtrAddressArray[Index];
        MDR_FLASH->CMD = Command | FLASH_CMD_XE | FLASH_CMD_YE | FLASH_CMD_SE;
        MDR_FLASH->DO; /* Idle reading for delay. */
        MDR_FLASH->DO; /* Idle reading for delay. */
        PtrDataArray[Index] = MDR_FLASH->DO;
    }
    MDR_FLASH->CMD = (Command & FLASH_CMD_DELAY_Msk) | FLASH_CMD_TMR;

#if defined(USE_MDR32F02)
    Index = *((volatile uint32_t*)FLASH_BASE); /* Errata 0011 workaround. */
#endif
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief  Erase one page (4 KByte) of a selected FLASH memory bank.
 * @note   This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @note   The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *         Before calling FLASH_ErasePage(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param  Address: Page address in the FLASH memory.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_ErasePage(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ErasePage_ID217(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t DelayConst;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

#if defined(USE_MDR1206FI) || defined(USE_MDR1206)
#if defined(USE_FACTORY_DATA_PROTECTION)
    if (Bank == FLASH_BANK_INFO) {
        if (FLASH_GetInfoPageNumber(Address) == FLASH_FACTORY_DATA_PAGE_NUMBER_ID217) {
            return;
        }
    }
#endif
#endif

    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = (MDR_FLASH->CMD & FLASH_CMD_DELAY_Msk) | FLASH_CMD_CON | FLASH_CMD_TMR;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_IFREN : 0;
    MDR_FLASH->CMD = Command;

    MDR_FLASH->ADR = Address;
    Command |= FLASH_CMD_XE | FLASH_CMD_ERASE;
    MDR_FLASH->CMD = Command;
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVS_US, DelayConst));

    Command |= FLASH_CMD_NVSTR;
    MDR_FLASH->CMD = Command;
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TERASE_US, DelayConst));

    Command &= ~FLASH_CMD_ERASE;
    MDR_FLASH->CMD = Command;
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVH_US, DelayConst));

    Command &= ~(FLASH_CMD_XE | FLASH_CMD_NVSTR);
    MDR_FLASH->CMD = Command;
    MDR_FLASH->CMD = (Command & FLASH_CMD_DELAY_Msk) | FLASH_CMD_TMR;
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief  Erase all pages of a selected FLASH memory bank.
 * @note   This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank.
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_EraseAllPages(FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_EraseAllPages_ID217(FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Page;
    uint32_t NumOfPages;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

#if defined(USE_MDR32F02)
    NumOfPages = 2;
#elif defined(USE_MDR1206FI) || defined(USE_MDR1206)
    NumOfPages = 4;
#endif

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
    if (Bank == FLASH_BANK_MAIN) {
        FLASH_MassErase(FLASH_ERASE_BANK_MAIN);
    } else { /* (Bank == FLASH_BANK_INFO) */
        for (Page = 0; Page < NumOfPages; Page++) {
            FLASH_ErasePage(Page << FLASH_ADR_INFO_XADR_PAGE_Pos, FLASH_BANK_INFO);
        }
    }
#elif defined(USE_MDR1206)
    if (Bank == FLASH_BANK_MAIN) {
        FLASH_MassErase_ID217(FLASH_ERASE_BANK_MAIN);
    } else { /* (Bank == FLASH_BANK_INFO) */
        for (Page = 0; Page < NumOfPages; Page++) {
            FLASH_ErasePage_ID217(Page << FLASH_ADR_INFO_XADR_PAGE_Pos, FLASH_BANK_INFO);
        }
    }
#endif
}

/**
 * @brief  Erase the main and the information banks.
 * @note   This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @param  None.
 * @return None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_EraseAllBanks(void)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_EraseAllBanks_ID217(void)
/** @endcond */
#endif
{
#if defined(USE_MDR32F02)
    FLASH_MassErase(FLASH_ERASE_BANK_ALL);
#elif defined(USE_MDR1206FI)
#if defined(USE_FACTORY_DATA_PROTECTION)
    FLASH_MassErase(FLASH_ERASE_BANK_MAIN);
    FLASH_EraseAllPages(FLASH_BANK_INFO);
#else
    FLASH_MassErase(FLASH_ERASE_BANK_ALL);
#endif
#elif defined(USE_MDR1206)
#if defined(USE_FACTORY_DATA_PROTECTION)
    FLASH_MassErase_ID217(FLASH_ERASE_BANK_MAIN);
    FLASH_EraseAllPages_ID217(FLASH_BANK_INFO);
#else
    FLASH_MassErase_ID217(FLASH_ERASE_BANK_ALL);
#endif
#endif
}

/**
 * @brief   Program a 32-bit FLASH memory value.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning The same address (32-bit data) can't be programmed more than twice before next erase.
 * @note    This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramWord(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory word address (four bytes aligned).
 * @param   Data: 32-bit data to be programmed.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_ProgramWord(uint32_t Address, uint32_t Data, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ProgramWord_ID217(uint32_t Address, uint32_t Data, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t DelayConst;
    uint32_t DelayProg;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(Address));
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

#if defined(USE_MDR1206FI) || defined(USE_MDR1206)
#if defined(USE_FACTORY_DATA_PROTECTION)
    if (Bank == FLASH_BANK_INFO) {
        if (((Address & FLASH_ADDR_INFO_WORD_MASK_ID217) >= FLASH_FACTORY_DATA_START_ADDR_ID217) &&
            ((Address & FLASH_ADDR_INFO_WORD_MASK_ID217) <= FLASH_FACTORY_DATA_END_ADDR_ID217)) {
            return;
        }
    }
#endif
#endif

    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);
    DelayProg  = DELAY_GET_TICKS_US(FLASH_TPROG_US, DelayConst);

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = (MDR_FLASH->CMD & FLASH_CMD_DELAY_Msk) | FLASH_CMD_CON | FLASH_CMD_TMR;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_IFREN : 0;
    MDR_FLASH->CMD = Command;

    MDR_FLASH->ADR = Address;
    MDR_FLASH->DI  = Data;

    Command |= FLASH_CMD_XE | FLASH_CMD_PROG;
    MDR_FLASH->CMD = Command;
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVS_US, DelayConst));

    Command |= FLASH_CMD_NVSTR;
    MDR_FLASH->CMD = Command;
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TPGS_US, DelayConst));

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
    FLASH_ProgramCycle(Command, DelayProg);
#elif defined(USE_MDR1206)
    FLASH_ProgramCycle_ID217(Command, DelayProg);
#endif

    Command &= ~FLASH_CMD_PROG;
    MDR_FLASH->CMD = Command;
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVH_US, DelayConst));

    Command &= ~(FLASH_CMD_XE | FLASH_CMD_NVSTR);
    MDR_FLASH->CMD = Command;
    MDR_FLASH->CMD = (Command & FLASH_CMD_DELAY_Msk) | FLASH_CMD_TMR;

    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRCV_US, DelayConst));
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief   Program a 16-bit FLASH memory value.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning The same address (32-bit data) can't be programmed more than twice before next erase.
 * @note    This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @note    Hardware supports only 32-bit word programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramHalfWord(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory half word address (two bytes aligned).
 * @param   Data: 16-bit data to be programmed.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_ProgramHalfWord(uint32_t Address, uint16_t Data, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ProgramHalfWord_ID217(uint32_t Address, uint16_t Data, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Mask;
    uint32_t Tmp;
    uint32_t Shift;
    uint32_t ProgData;

    /* Check the parameters. */
    assert_param(IS_FLASH_ADDR_TWO_BYTE_ALIGNED(Address));
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    Shift    = (Address & FLASH_ADDR_HALFWORD_MASK) * 8;
    ProgData = (uint32_t)Data << Shift;
    Mask     = (uint32_t)0xFFFF << Shift;
    Address &= ~FLASH_ADDR_FOUR_BYTE_ALIGN_MASK;

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
    Tmp      = FLASH_ReadWord(Address, Bank);
    ProgData = (Tmp & ~Mask) | (ProgData & Mask);
    FLASH_ProgramWord(Address, ProgData, Bank);
#elif defined(USE_MDR1206)
    Tmp      = FLASH_ReadWord_ID217(Address, Bank);
    ProgData = (Tmp & ~Mask) | (ProgData & Mask);
    FLASH_ProgramWord_ID217(Address, ProgData, Bank);
#endif
}

/**
 * @brief   Program an 8-bit FLASH memory value.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning The same address (32-bit data) can't be programmed more than twice before next erase.
 * @note    This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @note    Hardware supports only 32-bit word programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramByte(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory byte address.
 * @param   Data: 8-bit data to be programmed.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_ProgramByte(uint32_t Address, uint8_t Data, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ProgramByte_ID217(uint32_t Address, uint8_t Data, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Mask;
    uint32_t Tmp;
    uint32_t Shift;
    uint32_t ProgData;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    Shift    = (Address & FLASH_ADDR_BYTE_MASK) * 8;
    ProgData = (uint32_t)Data << Shift;
    Mask     = (uint32_t)0xFF << Shift;
    Address &= ~FLASH_ADDR_FOUR_BYTE_ALIGN_MASK;

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
    Tmp      = FLASH_ReadWord(Address, Bank);
    ProgData = (Tmp & ~Mask) | (ProgData & Mask);
    FLASH_ProgramWord(Address, ProgData, Bank);
#elif defined(USE_MDR1206)
    Tmp      = FLASH_ReadWord_ID217(Address, Bank);
    ProgData = (Tmp & ~Mask) | (ProgData & Mask);
    FLASH_ProgramWord_ID217(Address, ProgData, Bank);
#endif
}

/**
 * @brief   Program an array of the 32-bit FLASH memory values in the packet mode.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning The same address (32-bit data) can't be programmed more than twice before next erase.
 * @note    This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramWordBurst(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory word address from which the array will be programmed (four bytes aligned).
 * @param   PtrDataArray: The pointer to the data array to program.
 * @param   ArraySize: The size of data array.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_ProgramWordBurst(uint32_t Address, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ProgramWordBurst_ID217(uint32_t Address, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t DelayConst;
    uint32_t DelayProg;
    uint32_t Index;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(Address));
    assert_param(ArraySize > 0);
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);
    DelayProg  = DELAY_GET_TICKS_US(FLASH_TPROG_US, DelayConst);

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = (MDR_FLASH->CMD & FLASH_CMD_DELAY_Msk) | FLASH_CMD_CON | FLASH_CMD_TMR;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_IFREN : 0;
    MDR_FLASH->CMD = Command;

    Index = 0;
    while (Index < ArraySize) {
#if defined(USE_MDR1206FI) || defined(USE_MDR1206)
#if defined(USE_FACTORY_DATA_PROTECTION)
        if (Bank == FLASH_BANK_INFO) {
            if ((((Address + Index * 4) & FLASH_ADDR_INFO_WORD_MASK_ID217) >= FLASH_FACTORY_DATA_START_ADDR_ID217) &&
                (((Address + Index * 4) & FLASH_ADDR_INFO_WORD_MASK_ID217) <= FLASH_FACTORY_DATA_END_ADDR_ID217)) {
                Index++;
                continue;
            }
        }
#endif
#endif
        MDR_FLASH->ADR = Address + Index * 4;
        MDR_FLASH->DI  = PtrDataArray[Index];

        Command |= FLASH_CMD_XE | FLASH_CMD_PROG;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVS_US, DelayConst));

        Command |= FLASH_CMD_NVSTR;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TPGS_US, DelayConst));

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
        FLASH_ProgramCycle(Command, DelayProg);
#elif defined(USE_MDR1206)
        FLASH_ProgramCycle_ID217(Command, DelayProg);
#endif
        Index++;
        /* Can be programmed with reduced delays (without 30 us delay) if only YADR is changed. */
        while ((Index < ArraySize) && (((Address + (Index - 1) * 4) & ~FLASH_ADR_YADR_Msk) == ((Address + Index * 4) & ~FLASH_ADR_YADR_Msk))) {
#if defined(USE_MDR1206FI) || defined(USE_MDR1206)
#if defined(USE_FACTORY_DATA_PROTECTION)
            if (Bank == FLASH_BANK_INFO) {
                if ((((Address + Index * 4) & FLASH_ADDR_INFO_WORD_MASK_ID217) >= FLASH_FACTORY_DATA_START_ADDR_ID217) &&
                    (((Address + Index * 4) & FLASH_ADDR_INFO_WORD_MASK_ID217) <= FLASH_FACTORY_DATA_END_ADDR_ID217)) {
                    Index++;
                    continue;
                }
            }
#endif
#endif
            MDR_FLASH->ADR = Address + Index * 4;
            MDR_FLASH->DI  = PtrDataArray[Index];
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
            FLASH_ProgramCycle(Command, DelayProg);
#elif defined(USE_MDR1206)
            FLASH_ProgramCycle_ID217(Command, DelayProg);
#endif
            Index++;
        }
        Command &= ~FLASH_CMD_PROG;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVH_US, DelayConst));

        Command &= ~(FLASH_CMD_XE | FLASH_CMD_NVSTR);
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRCV_US, DelayConst));
    }

