piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
    MDR_FLASH->CMD = (Command & FLASH_CMD_DELAY_Msk) | FLASH_CMD_TMR;
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief   Program an array of the 32-bit FLASH memory values at specified addresses from the array in the packet mode.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning The same address (32-bit data) can't be programmed more than twice before next erase.
 * @note    This function can be used only for MDR32F02 and MDR1206FI (ID = 217).
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramWordArrayBurst(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   PtrAddressArray: The pointer to the array with FLASH memory words addresses to write (four bytes aligned).
 * @param   PtrDataArray: The pointer to the data array to program.
 * @param   ArraySize: The size of address and data arrays.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
void FLASH_ProgramWordArrayBurst(const uint32_t* PtrAddressArray, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ProgramWordArrayBurst_ID217(const uint32_t* PtrAddressArray, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t DelayConst;
    uint32_t DelayProg;
    uint32_t Index;
    uint32_t MStatus;

    /* Check the parameters. */
#if (USE_ASSERT_INFO != 0)
    for (Index = 0; Index < ArraySize; Index++) {
        assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(PtrAddressArray[Index]));
    }
#endif
    assert_param(ArraySize > 0);
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);
    DelayProg  = DELAY_GET_TICKS_US(FLASH_TPROG_US, DelayConst);

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = (MDR_FLASH->CMD & FLASH_CMD_DELAY_Msk) | FLASH_CMD_CON | FLASH_CMD_TMR;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_IFREN : 0;
    MDR_FLASH->CMD = Command;

    Index = 0;
    while (Index < ArraySize) {
#if defined(USE_MDR1206FI) || defined(USE_MDR1206)
#if defined(USE_FACTORY_DATA_PROTECTION)
        if (Bank == FLASH_BANK_INFO) {
            if (((PtrAddressArray[Index] & FLASH_ADDR_INFO_WORD_MASK_ID217) >= FLASH_FACTORY_DATA_START_ADDR_ID217) &&
                ((PtrAddressArray[Index] & FLASH_ADDR_INFO_WORD_MASK_ID217) <= FLASH_FACTORY_DATA_END_ADDR_ID217)) {
                Index++;
                continue;
            }
        }
#endif
#endif
        MDR_FLASH->ADR = PtrAddressArray[Index];
        MDR_FLASH->DI  = PtrDataArray[Index];

        Command |= FLASH_CMD_XE | FLASH_CMD_PROG;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVS_US, DelayConst));

        Command |= FLASH_CMD_NVSTR;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TPGS_US, DelayConst));

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
        FLASH_ProgramCycle(Command, DelayProg);
#elif defined(USE_MDR1206)
        FLASH_ProgramCycle_ID217(Command, DelayProg);
#endif
        Index++;
        /* Can be programmed with reduced delays (without 30 us delay) if only YADR is changed. */
        while ((Index < ArraySize) && ((PtrAddressArray[Index - 1] & ~FLASH_ADR_YADR_Msk) == (PtrAddressArray[Index] & ~FLASH_ADR_YADR_Msk))) {
#if defined(USE_MDR1206FI) || defined(USE_MDR1206)
#if defined(USE_FACTORY_DATA_PROTECTION)
            if (Bank == FLASH_BANK_INFO) {
                if (((PtrAddressArray[Index] & FLASH_ADDR_INFO_WORD_MASK_ID217) >= FLASH_FACTORY_DATA_START_ADDR_ID217) &&
                    ((PtrAddressArray[Index] & FLASH_ADDR_INFO_WORD_MASK_ID217) <= FLASH_FACTORY_DATA_END_ADDR_ID217)) {
                    Index++;
                    continue;
                }
            }
#endif
#endif
            MDR_FLASH->ADR = PtrAddressArray[Index];
            MDR_FLASH->DI  = PtrDataArray[Index];
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI)
            FLASH_ProgramCycle(Command, DelayProg);
#elif defined(USE_MDR1206)
            FLASH_ProgramCycle_ID217(Command, DelayProg);
#endif
            Index++;
        }
        Command &= ~FLASH_CMD_PROG;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVH_US, DelayConst));

        Command &= ~(FLASH_CMD_XE | FLASH_CMD_NVSTR);
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRCV_US, DelayConst));
    }

    MDR_FLASH->CMD = (Command & FLASH_CMD_DELAY_Msk) | FLASH_CMD_TMR;
    CSR_Write(CSR_MSTATUS, MStatus);
}
#endif

#if defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief  Read a 32-bit FLASH memory value.
 * @note   This function can be used only for MDR1206AFI (ID = 215).
 * @param  Address: A FLASH memory word address (four bytes aligned).
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return The selected FLASH memory word.
 */
#if defined(USE_MDR1206AFI)
uint32_t FLASH_ReadWord(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static uint32_t FLASH_ReadWord_ID215(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t Data;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));
    assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(Address));

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = FLASH_CMD_CON | FLASH_CMD_TMEN;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_NVR : 0;
    MDR_FLASH->CMD = Command;
    MDR_FLASH->ADR = FLASH_ConvertAddress(Address, Bank);
    MDR_FLASH->CMD = Command | FLASH_CMD_CE | FLASH_CMD_RE;
    MDR_FLASH->DO; /* Idle reading for delay. */
    MDR_FLASH->DO; /* Idle reading for delay. */
    Data           = MDR_FLASH->DO;
    MDR_FLASH->CMD = FLASH_CMD_TMEN;
    CSR_Write(CSR_MSTATUS, MStatus);

