piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
    return Data;
}

/**
 * @brief  Read the array of the 32-bit FLASH memory values in the packet mode.
 * @note   This function can be used only for MDR1206AFI (ID = 215).
 * @param  Address: A FLASH memory word address from which the array will be read (four bytes aligned).
 * @param  PtrDataArray: The pointer to the array where the words read from the FLASH memory will be stored.
 * @param  ArraySize: The size of data array.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_ReadWordBurst(uint32_t Address, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ReadWordBurst_ID215(uint32_t Address, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t Index;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(Address));
    assert_param(ArraySize > 0);
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = FLASH_CMD_CON | FLASH_CMD_TMEN;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_NVR : 0;
    MDR_FLASH->CMD = Command;

    for (Index = 0; Index < ArraySize; Index++) {
        MDR_FLASH->CMD = Command | FLASH_CMD_CE;
        MDR_FLASH->ADR = FLASH_ConvertAddress(Address + Index * 4, Bank);
        MDR_FLASH->CMD = Command | FLASH_CMD_CE | FLASH_CMD_RE;
        MDR_FLASH->DO; /* Idle reading for delay. */
        MDR_FLASH->DO; /* Idle reading for delay. */
        PtrDataArray[Index] = MDR_FLASH->DO;
    }
    MDR_FLASH->CMD = FLASH_CMD_TMEN;
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief  Read the array of the 32-bit FLASH memory values at specified addresses from the array in the packet mode.
 * @note   This function can be used only for MDR1206AFI (ID = 215).
 * @param  PtrAddressArray: The pointer to the array with FLASH memory words addresses to read (four bytes aligned).
 * @param  PtrDataArray: The pointer to the array where the words read from the FLASH memory will be stored.
 * @param  ArraySize: The size of address and data arrays.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_ReadWordArrayBurst(const uint32_t* PtrAddressArray, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ReadWordArrayBurst_ID215(const uint32_t* PtrAddressArray, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t Index;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));
    assert_param(ArraySize > 0);
#if (USE_ASSERT_INFO != 0)
    for (Index = 0; Index < ArraySize; Index++) {
        assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(PtrAddressArray[Index]));
    }
#endif

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = FLASH_CMD_CON | FLASH_CMD_TMEN;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_NVR : 0;
    MDR_FLASH->CMD = Command;

    for (Index = 0; Index < ArraySize; Index++) {
        MDR_FLASH->CMD = Command | FLASH_CMD_CE;
        MDR_FLASH->ADR = FLASH_ConvertAddress(PtrAddressArray[Index], Bank);
        MDR_FLASH->CMD = Command | FLASH_CMD_CE | FLASH_CMD_RE;
        MDR_FLASH->DO; /* Idle reading for delay. */
        MDR_FLASH->DO; /* Idle reading for delay. */
        PtrDataArray[Index] = MDR_FLASH->DO;
    }
    MDR_FLASH->CMD = FLASH_CMD_TMEN;
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief  Erase one page (1 KByte) of a selected FLASH memory bank.
 * @note   This function can be used only for MDR1206AFI (ID = 215).
 * @note   The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *         Before calling FLASH_ErasePage(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param  Address: Page address in the FLASH memory.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_ErasePage(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ErasePage_ID215(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t DelayConst;
    uint32_t Sector;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

#if defined(USE_FACTORY_DATA_PROTECTION)
    if (Bank == FLASH_BANK_INFO) {
        if (FLASH_GetInfoPageNumber(Address) == FLASH_FACTORY_DATA_PAGE_NUMBER_ID215) {
            return;
        }
    }
#endif

    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = FLASH_CMD_CON | FLASH_CMD_TMEN;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_NVR : 0;
    MDR_FLASH->CMD = Command;

    for (Sector = 0; Sector < 2; Sector++) {
        Address        = (Address & ~FLASH_ADDR_SECTOR_MASK) | (Sector << FLASH_ADDR_SECTOR_POS);
        MDR_FLASH->ADR = FLASH_ConvertAddress(Address, Bank);

        Command |= FLASH_CMD_CE | FLASH_CMD_ERASE;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVS_SECTOR_ERASE_US, DelayConst));

        Command |= FLASH_CMD_WE;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TERASE_SECTOR_ERASE_US, DelayConst));

        Command &= ~FLASH_CMD_WE;
        MDR_FLASH->CMD = Command;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRCV_SECTOR_ERASE_US, DelayConst));

        Command &= ~(FLASH_CMD_CE | FLASH_CMD_ERASE);
        MDR_FLASH->CMD = Command;
    }
    MDR_FLASH->CMD = FLASH_CMD_TMEN;

    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRW_SECTOR_ERASE_US, DelayConst));
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief  Erase all pages of a selected FLASH memory bank.
 * @note   This function can be used only for MDR1206AFI (ID = 215).
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank.
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_EraseAllPages(FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_EraseAllPages_ID215(FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Page;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

