piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
#if defined(USE_MDR1206AFI)
    if (Bank == FLASH_BANK_MAIN) {
        FLASH_MassErase();
    } else { /* (Bank == FLASH_BANK_INFO) */
        for (Page = 0; Page < 15; Page++) {
            FLASH_ErasePage(FLASH_GET_INFO_PAGE_ADDR(Page), FLASH_BANK_INFO);
        }
    }
#elif defined(USE_MDR1206)
    if (Bank == FLASH_BANK_MAIN) {
        FLASH_MassErase_ID215();
    } else { /* (Bank == FLASH_BANK_INFO) */
        for (Page = 0; Page < 15; Page++) {
            FLASH_ErasePage_ID215(FLASH_GET_INFO_PAGE_ADDR_ID215(Page), FLASH_BANK_INFO);
        }
    }
#endif
}

/**
 * @brief  Erase the main and the information banks.
 * @note   This function can be used only for MDR1206AFI (ID = 215).
 * @param  None.
 * @return None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_EraseAllBanks(void)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_EraseAllBanks_ID215(void)
/** @endcond */
#endif
{
#if defined(USE_MDR1206AFI)
    FLASH_MassErase();
    FLASH_EraseAllPages(FLASH_BANK_INFO);
#elif defined(USE_MDR1206)
    FLASH_MassErase_ID215();
    FLASH_EraseAllPages_ID215(FLASH_BANK_INFO);
#endif
}

/**
 * @brief   Program a 32-bit FLASH memory value.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning The same address (8-bit data) can't be programmed again before next erase.
 * @note    This function can be used only for MDR1206AFI (ID = 215).
 * @note    Hardware supports only 8-bit data programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramWord(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory word address (four bytes aligned).
 * @param   Data: 32-bit data to be programmed.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_ProgramWord(uint32_t Address, uint32_t Data, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ProgramWord_ID215(uint32_t Address, uint32_t Data, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    /* Check the parameters. */
    assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(Address));
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    FLASH_ProgramBytes(Address, Data, FLASH_PROGRAM_SIZE_4BYTE, Bank);
}

/**
 * @brief   Program a 16-bit FLASH memory value.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning The same address (8-bit data) can't be programmed again before next erase.
 * @note    This function can be used only for MDR1206AFI (ID = 215).
 * @note    Hardware supports only 8-bit data programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramHalfWord(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory half word address (two bytes aligned).
 * @param   Data: 16-bit data to be programmed.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_ProgramHalfWord(uint32_t Address, uint16_t Data, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ProgramHalfWord_ID215(uint32_t Address, uint16_t Data, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Shift;
    uint32_t ProgData;

    /* Check the parameters. */
    assert_param(IS_FLASH_ADDR_TWO_BYTE_ALIGNED(Address));
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    Shift    = (Address & FLASH_ADDR_HALFWORD_MASK) * 8;
    ProgData = (uint32_t)Data << Shift;

    FLASH_ProgramBytes(Address, ProgData, FLASH_PROGRAM_SIZE_2BYTE, Bank);
}

/**
 * @brief   Program an 8-bit FLASH memory value.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning The same address (8-bit data) can't be programmed again before next erase.
 * @note    This function can be used only for MDR1206AFI (ID = 215).
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramByte(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory byte address.
 * @param   Data: 8-bit data to be programmed.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_ProgramByte(uint32_t Address, uint8_t Data, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ProgramByte_ID215(uint32_t Address, uint8_t Data, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Shift;
    uint32_t ProgData;

    /* Check the parameters. */
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    Shift    = (Address & FLASH_ADDR_BYTE_MASK) * 8;
    ProgData = (uint32_t)Data << Shift;

    FLASH_ProgramBytes(Address, ProgData, FLASH_PROGRAM_SIZE_1BYTE, Bank);
}

/**
 * @brief   Program an array of the 32-bit FLASH memory values in the packet mode.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning The same address (8-bit data) can't be programmed again before next erase.
 * @note    This function can be used only for MDR1206AFI (ID = 215).
 * @note    Hardware supports only 8-bit data programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramWordBurst(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory word address from which the array will be programmed (four bytes aligned).
 * @param   PtrDataArray: The pointer to the data array to program.
 * @param   ArraySize: The size of data array.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_ProgramWordBurst(uint32_t Address, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ProgramWordBurst_ID215(uint32_t Address, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t DelayConst;
    uint32_t DelayProg;
    uint32_t DelayAdsAdh;
    uint32_t DelayPgs;
    uint32_t Sector;
    uint32_t Index;
    uint32_t MStatus;

    /* Check the parameters. */
    assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(Address));
    assert_param(ArraySize > 0);
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

