piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
    DelayConst  = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);
    DelayProg   = DELAY_GET_TICKS_US(FLASH_TPROG_PROGRAM_US, DelayConst);
    DelayAdsAdh = DELAY_GET_TICKS_US(FLASH_TADS_PROGRAM_US, DelayConst);
    DelayPgs    = DELAY_GET_TICKS_US(FLASH_TPGS_PROGRAM_US, DelayConst);

    /* Correct DelayProg for SystemCoreClock <= 16 MHz. */
    DelayProg = (SystemCoreClock > 16000000) ? DelayProg : DelayProg - 7;

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = FLASH_CMD_CON | FLASH_CMD_TMEN;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_NVR : 0;
    MDR_FLASH->CMD = Command;

    for (Sector = 0; Sector < 2; Sector++) {
        Index = (FLASH_GET_SECTOR_NUMBER(Address) == Sector) ? 0 : 1;
        for (; Index < ArraySize;) {
#if defined(USE_FACTORY_DATA_PROTECTION)
            if (Bank == FLASH_BANK_INFO) {
                if ((((Address + Index * 4) & FLASH_ADDR_INFO_WORD_MASK_ID215) >= FLASH_FACTORY_DATA_START_ADDR_ID215) &&
                    (((Address + Index * 4) & FLASH_ADDR_INFO_WORD_MASK_ID215) <= FLASH_FACTORY_DATA_END_ADDR_ID215)) {
                    Index += 2;
                    continue;
                }
            }
#endif
            MDR_FLASH->ADR = FLASH_ConvertAddress(Address + Index * 4, Bank);
            MDR_FLASH->DI  = PtrDataArray[Index];

            Command |= FLASH_CMD_CE | FLASH_CMD_PROG;
            MDR_FLASH->CMD = Command;
            DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVS_PROGRAM_US, DelayConst));

            Command |= FLASH_CMD_WE;
            MDR_FLASH->CMD = Command;
            DELAY_CycleCounter_WaitTicksAsm(DelayPgs);

#if defined(USE_MDR1206AFI)
            FLASH_ProgramCycle(0, FLASH_PROGRAM_SIZE_4BYTE, Command, DelayProg, DelayAdsAdh);
#elif defined(USE_MDR1206)
            FLASH_ProgramCycle_ID215(0, FLASH_PROGRAM_SIZE_4BYTE, Command, DelayProg, DelayAdsAdh);
#endif
            Index += 2;
            /* Can be programmed with reduced delays if only WORD address is changed. */
            for (; Index < ArraySize; Index += 2) {
#if defined(USE_FACTORY_DATA_PROTECTION)
                if (Bank == FLASH_BANK_INFO) {
                    if ((((Address + Index * 4) & FLASH_ADDR_INFO_WORD_MASK_ID215) >= FLASH_FACTORY_DATA_START_ADDR_ID215) &&
                        (((Address + Index * 4) & FLASH_ADDR_INFO_WORD_MASK_ID215) <= FLASH_FACTORY_DATA_END_ADDR_ID215)) {
                        continue;
                    }
                }
#endif
                if (((Address + (Index - 2) * 4) & ~(FLASH_ADR_WORD_Msk << 1)) == ((Address + Index * 4) & ~(FLASH_ADR_WORD_Msk << 1))) {
                    MDR_FLASH->ADR = FLASH_ConvertAddress((Address + Index * 4), Bank);
                    MDR_FLASH->DI  = PtrDataArray[Index];
#if defined(USE_MDR1206AFI)
                    FLASH_ProgramCycle(0, FLASH_PROGRAM_SIZE_4BYTE, Command, DelayProg, DelayAdsAdh);
#elif defined(USE_MDR1206)
                    FLASH_ProgramCycle_ID215(0, FLASH_PROGRAM_SIZE_4BYTE, Command, DelayProg, DelayAdsAdh);
#endif
                } else {
                    break;
                }
            }
            Command &= ~FLASH_CMD_WE;
            MDR_FLASH->CMD = Command;
            DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRCV_PROGRAM_US, DelayConst));

            Command &= ~(FLASH_CMD_CE | FLASH_CMD_PROG);
            MDR_FLASH->CMD = Command;
            DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRW_PROGRAM_US, DelayConst));
        }
    }
    MDR_FLASH->CMD = FLASH_CMD_TMEN;
    CSR_Write(CSR_MSTATUS, MStatus);
}

/**
 * @brief   Program an array of the 32-bit FLASH memory values at specified addresses from the array in the packet mode.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning The same address (8-bit data) can't be programmed again before next erase.
 * @note    This function can be used only for MDR1206AFI (ID = 215).
 * @note    Hardware supports only 8-bit data programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramWordArrayBurst(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   PtrAddressArray: The pointer to the array with FLASH memory words addresses to write (four bytes aligned).
 * @param   PtrDataArray: The pointer to the data array to program.
 * @param   ArraySize: The size of address and data arrays.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
#if defined(USE_MDR1206AFI)
void FLASH_ProgramWordArrayBurst(const uint32_t* PtrAddressArray, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
#elif defined(USE_MDR1206)
/** @cond */
static void FLASH_ProgramWordArrayBurst_ID215(const uint32_t* PtrAddressArray, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
/** @endcond */
#endif
{
    uint32_t Command;
    uint32_t DelayConst;
    uint32_t DelayProg;
    uint32_t DelayAdsAdh;
    uint32_t DelayPgs;
    uint32_t Sector;
    uint32_t Index;
    uint32_t PreviousIndex;
    uint32_t MStatus;

    /* Check the parameters. */
#if (USE_ASSERT_INFO != 0)
    for (Index = 0; Index < ArraySize; Index++) {
        assert_param(IS_FLASH_ADDR_FOUR_BYTE_ALIGNED(PtrAddressArray[Index]));
    }
#endif
    assert_param(ArraySize > 0);
    assert_param(IS_FLASH_MEMORY_BANK(Bank));

    DelayConst  = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);
    DelayProg   = DELAY_GET_TICKS_US(FLASH_TPROG_PROGRAM_US, DelayConst);
    DelayAdsAdh = DELAY_GET_TICKS_US(FLASH_TADS_PROGRAM_US, DelayConst);
    DelayPgs    = DELAY_GET_TICKS_US(FLASH_TPGS_PROGRAM_US, DelayConst);

    /* Correct DelayProg for SystemCoreClock <= 16 MHz. */
    DelayProg = (SystemCoreClock > 16000000) ? DelayProg : DelayProg - 7;

    MStatus = CSR_ReadClearBits(CSR_MSTATUS, CSR_MSTATUS_MIE);
    Command = FLASH_CMD_CON | FLASH_CMD_TMEN;
    Command |= (Bank == FLASH_BANK_INFO) ? FLASH_CMD_NVR : 0;
    MDR_FLASH->CMD = Command;

    for (Sector = 0; Sector < 2; Sector++) {
        for (Index = 0; Index < ArraySize;) {
#if defined(USE_FACTORY_DATA_PROTECTION)
            if (Bank == FLASH_BANK_INFO) {
                if (((PtrAddressArray[Index] & FLASH_ADDR_INFO_WORD_MASK_ID215) >= FLASH_FACTORY_DATA_START_ADDR_ID215) &&
                    ((PtrAddressArray[Index] & FLASH_ADDR_INFO_WORD_MASK_ID215) <= FLASH_FACTORY_DATA_END_ADDR_ID215)) {
                    Index++;
                    continue;
                }
            }
#endif
            if (FLASH_GET_SECTOR_NUMBER(PtrAddressArray[Index]) == Sector) {
                MDR_FLASH->ADR = FLASH_ConvertAddress(PtrAddressArray[Index], Bank);
                MDR_FLASH->DI  = PtrDataArray[Index];

                Command |= FLASH_CMD_CE | FLASH_CMD_PROG;
                MDR_FLASH->CMD = Command;
                DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TNVS_PROGRAM_US, DelayConst));

                Command |= FLASH_CMD_WE;
                MDR_FLASH->CMD = Command;
                DELAY_CycleCounter_WaitTicksAsm(DelayPgs);

