piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_flash.c
#if defined(USE_MDR1206AFI)
                FLASH_ProgramCycle(0, FLASH_PROGRAM_SIZE_4BYTE, Command, DelayProg, DelayAdsAdh);
#elif defined(USE_MDR1206)
                FLASH_ProgramCycle_ID215(0, FLASH_PROGRAM_SIZE_4BYTE, Command, DelayProg, DelayAdsAdh);
#endif
                PreviousIndex = Index;
                Index++;
                /* Can be programmed with reduced delays if only WORD address is changed. */
                for (; Index < ArraySize; Index++) {
                    if (FLASH_GET_SECTOR_NUMBER(PtrAddressArray[Index]) == Sector) {
#if defined(USE_FACTORY_DATA_PROTECTION)
                        if (Bank == FLASH_BANK_INFO) {
                            if (((PtrAddressArray[Index] & FLASH_ADDR_INFO_WORD_MASK_ID215) >= FLASH_FACTORY_DATA_START_ADDR_ID215) &&
                                ((PtrAddressArray[Index] & FLASH_ADDR_INFO_WORD_MASK_ID215) <= FLASH_FACTORY_DATA_END_ADDR_ID215)) {
                                continue;
                            }
                        }
#endif
                        if ((PtrAddressArray[PreviousIndex] & ~(FLASH_ADR_WORD_Msk << 1)) == (PtrAddressArray[Index] & ~(FLASH_ADR_WORD_Msk << 1))) {
                            MDR_FLASH->ADR = FLASH_ConvertAddress(PtrAddressArray[Index], Bank);
                            MDR_FLASH->DI  = PtrDataArray[Index];
#if defined(USE_MDR1206AFI)
                            FLASH_ProgramCycle(0, FLASH_PROGRAM_SIZE_4BYTE, Command, DelayProg, DelayAdsAdh);
#elif defined(USE_MDR1206)
                            FLASH_ProgramCycle_ID215(0, FLASH_PROGRAM_SIZE_4BYTE, Command, DelayProg, DelayAdsAdh);
#endif
                            PreviousIndex = Index;
                        } else {
                            break;
                        }
                    }
                }
                Command &= ~FLASH_CMD_WE;
                MDR_FLASH->CMD = Command;
                DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRCV_PROGRAM_US, DelayConst));

                Command &= ~(FLASH_CMD_CE | FLASH_CMD_PROG);
                MDR_FLASH->CMD = Command;
                DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(FLASH_TRW_PROGRAM_US, DelayConst));
            } else {
                Index++;
            }
        }
    }
    MDR_FLASH->CMD = FLASH_CMD_TMEN;
    CSR_Write(CSR_MSTATUS, MStatus);
}
#endif

#if defined(USE_MDR1206)
/**
 * @brief  Read a 32-bit FLASH memory value.
 * @note   Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @param  Address: A FLASH memory word address (four bytes aligned).
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return The selected FLASH memory word.
 */
uint32_t FLASH_ReadWord(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
{
    uint32_t Data;

    if (GetChipID() == CHIP_ID_MDR1206FI) {
        Data = FLASH_ReadWord_ID217(Address, Bank);
    } else {
        Data = FLASH_ReadWord_ID215(Address, Bank);
    }

    return Data;
}

/**
 * @brief  Read the array of the 32-bit FLASH memory values in the packet mode.
 * @note   Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @param  Address: A FLASH memory word address from which the array will be read (four bytes aligned).
 * @param  PtrDataArray: The pointer to the array where the words read from the FLASH memory will be stored.
 * @param  ArraySize: The size of data array.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
void FLASH_ReadWordBurst(uint32_t Address, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
{
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FLASH_ReadWordBurst_ID217(Address, PtrDataArray, ArraySize, Bank);
    } else {
        FLASH_ReadWordBurst_ID215(Address, PtrDataArray, ArraySize, Bank);
    }
}

/**
 * @brief  Read the array of the 32-bit FLASH memory values at specified addresses from the array in the packet mode.
 * @note   Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @param  PtrAddressArray: The pointer to the array with FLASH memory words addresses to read (four bytes aligned).
 * @param  PtrDataArray: The pointer to the array where the words read from the FLASH memory will be stored.
 * @param  ArraySize: The size of address and data arrays.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
void FLASH_ReadWordArrayBurst(const uint32_t* PtrAddressArray, uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
{
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FLASH_ReadWordArrayBurst_ID217(PtrAddressArray, PtrDataArray, ArraySize, Bank);
    } else {
        FLASH_ReadWordArrayBurst_ID215(PtrAddressArray, PtrDataArray, ArraySize, Bank);
    }
}

/**
 * @brief  Erase one page of a selected FLASH memory bank:
 *         - MDR1206FI (ID = 217): page is 4 KByte;
 *         - MDR1206AFI (ID = 215): page is 1 KByte.
 * @note   Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @note   The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *         Before calling FLASH_ErasePage(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param  Address: Page address in the FLASH memory.
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
void FLASH_ErasePage(uint32_t Address, FLASH_MemoryBank_TypeDef Bank)
{
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FLASH_ErasePage_ID217(Address, Bank);
    } else {
        FLASH_ErasePage_ID215(Address, Bank);
    }
}

/**
 * @brief  Erase all pages of a selected FLASH memory bank.
 * @note   Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @param  Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank.
 *         This parameter can be one of the following values:
 *             @arg FLASH_BANK_MAIN: The FLASH main bank;
 *             @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return None.
 */
void FLASH_EraseAllPages(FLASH_MemoryBank_TypeDef Bank)
{
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FLASH_EraseAllPages_ID217(Bank);
    } else {
        FLASH_EraseAllPages_ID215(Bank);
    }
}

/**
 * @brief  Erase the main and the information banks.
 * @note   Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @param  None.
 * @return None.
 */
void FLASH_EraseAllBanks(void)
{
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FLASH_EraseAllBanks_ID217();
    } else {
        FLASH_EraseAllBanks_ID215();
    }
}

/**
 * @brief   Program a 32-bit FLASH memory value.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning Programming the same address:
 *          - MDR1206FI (ID = 217): the same address (32-bit data) can't be programmed more than twice before next erase;
 *          - MDR1206AFI (ID = 215): the same address (8-bit data) can't be programmed again before next erase.
 * @note    Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @note    Hardware supports only:
 *          - MDR1206FI (ID = 217): 32-bit data programming;
 *          - MDR1206AFI (ID = 215): 8-bit data programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramWord(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory word address (four bytes aligned).
 * @param   Data: 32-bit data to be programmed.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
void FLASH_ProgramWord(uint32_t Address, uint32_t Data, FLASH_MemoryBank_TypeDef Bank)
{
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FLASH_ProgramWord_ID217(Address, Data, Bank);
    } else {
        FLASH_ProgramWord_ID215(Address, Data, Bank);
    }
}

/**
 * @brief   Program a 16-bit FLASH memory value.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning Programming the same address:
 *          - MDR1206FI (ID = 217): the same address (32-bit data) can't be programmed more than twice before next erase;
 *          - MDR1206AFI (ID = 215): the same address (8-bit data) can't be programmed again before next erase.
 * @note    Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @note    Hardware supports only:
 *          - MDR1206FI (ID = 217): 32-bit data programming;
 *          - MDR1206AFI (ID = 215): 8-bit data programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramHalfWord(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory half word address (two bytes aligned).
 * @param   Data: 16-bit data to be programmed.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
void FLASH_ProgramHalfWord(uint32_t Address, uint16_t Data, FLASH_MemoryBank_TypeDef Bank)
{
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FLASH_ProgramHalfWord_ID217(Address, Data, Bank);
    } else {
        FLASH_ProgramHalfWord_ID215(Address, Data, Bank);
    }
}

/**
 * @brief   Program an 8-bit FLASH memory value.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning Programming the same address:
 *          - MDR1206FI (ID = 217): the same address (32-bit data) can't be programmed more than twice before next erase;
 *          - MDR1206AFI (ID = 215): the same address (8-bit data) can't be programmed again before next erase.
 * @note    Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @note    Hardware supports only:
 *          - MDR1206FI (ID = 217): 32-bit data programming;
 *          - MDR1206AFI (ID = 215): 8-bit data programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramByte(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory byte address.
 * @param   Data: 8-bit data to be programmed.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
void FLASH_ProgramByte(uint32_t Address, uint8_t Data, FLASH_MemoryBank_TypeDef Bank)
{
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FLASH_ProgramByte_ID217(Address, Data, Bank);
    } else {
        FLASH_ProgramByte_ID215(Address, Data, Bank);
    }
}

/**
 * @brief   Program an array of the 32-bit FLASH memory values in the packet mode.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning Programming the same address:
 *          - MDR1206FI (ID = 217): the same address (32-bit data) can't be programmed more than twice before next erase;
 *          - MDR1206AFI (ID = 215): the same address (8-bit data) can't be programmed again before next erase.
 * @note    Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @note    Hardware supports only:
 *          - MDR1206FI (ID = 217): 32-bit data programming;
 *          - MDR1206AFI (ID = 215): 8-bit data programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramWordBurst(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   Address: A FLASH memory word address from which the array will be programmed (four bytes aligned).
 * @param   PtrDataArray: The pointer to the data array to program.
 * @param   ArraySize: The size of data array.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
void FLASH_ProgramWordBurst(uint32_t Address, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
{
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FLASH_ProgramWordBurst_ID217(Address, PtrDataArray, ArraySize, Bank);
    } else {
        FLASH_ProgramWordBurst_ID215(Address, PtrDataArray, ArraySize, Bank);
    }
}

/**
 * @brief   Program an array of the 32-bit FLASH memory values at specified addresses from the array in the packet mode.
 * @warning To count the correct delay times, the core clock must be at least 8 MHz.
 * @warning Programming the same address:
 *          - MDR1206FI (ID = 217): the same address (32-bit data) can't be programmed more than twice before next erase;
 *          - MDR1206AFI (ID = 215): the same address (8-bit data) can't be programmed again before next erase.
 * @note    Common function for MDR1206FI (ID = 217) and MDR1206AFI (ID = 215).
 * @note    Hardware supports only:
 *          - MDR1206FI (ID = 217): 32-bit data programming;
 *          - MDR1206AFI (ID = 215): 8-bit data programming.
 * @note    The delay uses the cycle counter and core clock from SystemCoreClock. Do not disable the cycle counter.
 *          Before calling FLASH_ProgramWordArrayBurst(), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param   PtrAddressArray: The pointer to the array with FLASH memory words addresses to write (four bytes aligned).
 * @param   PtrDataArray: The pointer to the data array to program.
 * @param   ArraySize: The size of address and data arrays.
 * @param   Bank: @ref FLASH_MemoryBank_TypeDef - select a FLASH bank (the main bank or the information bank).
 *          This parameter can be one of the following values:
 *              @arg FLASH_BANK_MAIN: The FLASH main bank;
 *              @arg FLASH_BANK_INFO: The FLASH information bank.
 * @return  None.
 */
void FLASH_ProgramWordArrayBurst(const uint32_t* PtrAddressArray, const uint32_t* PtrDataArray, uint32_t ArraySize, FLASH_MemoryBank_TypeDef Bank)
{
    if (GetChipID() == CHIP_ID_MDR1206FI) {
        FLASH_ProgramWordArrayBurst_ID217(PtrAddressArray, PtrDataArray, ArraySize, Bank);
    } else {
        FLASH_ProgramWordArrayBurst_ID215(PtrAddressArray, PtrDataArray, ArraySize, Bank);
    }
}
#endif

/** @} */ /* End of the group FLASH_Exported_Register_Access_Functions_Not_Allowed_to_Be_Located_in_FLASH */

/** @} */ /* End of the group FLASH_Exported_Functions_Not_Allowed_to_Be_Located_in_FLASH */

/** @} */ /* End of the group FLASH_Exported_Functions */

/** @} */ /* End of the group FLASH */

/** @} */ /* End of the group MDR32VF0xI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32VF0xI_flash.c */

